# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy  as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [11]:
random_series= pd.Series(np.random.randint(1,4,size=100,dtype="I"))
random_series

0     1
1     2
2     1
3     2
4     2
     ..
95    1
96    2
97    2
98    1
99    3
Length: 100, dtype: uint32

In [10]:
random_series2= pd.Series(np.random.randint(10000,30000,size=100,dtype="I"))
random_series2

0     25623
1     11526
2     11492
3     16457
4     23401
      ...
95    15176
96    17252
97    15151
98    17646
99    11287
Length: 100, dtype: uint32

In [12]:
random_series3= pd.Series(np.random.randint(1,4,size=100,dtype="I"))
random_series3

0     1
1     2
2     1
3     1
4     3
     ..
95    2
96    1
97    3
98    2
99    3
Length: 100, dtype: uint32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [15]:
series = pd.concat([random_series, random_series2, random_series3], axis=1)
series.head()

   0      1  2
0  1  25623  1
1  2  11526  2
2  1  11492  1
3  2  16457  1
4  2  23401  3

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
series.rename(columns={0:"bedrs", 1:"bathrs", 2:"price_sqr_meter"},inplace=True)
series

    bedrs  bathrs  price_sqr_meter
0       1   25623                1
1       2   11526                2
2       1   11492                1
3       2   16457                1
4       2   23401                3
..    ...     ...              ...
95      1   15176                2
96      2   17252                1
97      2   15151                3
98      1   17646                2
99      3   11287                3

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [22]:
bigcolumn = pd.concat([random_series, random_series2, random_series3], axis=0)
bigcolumn= bigcolumn.to_frame()
bigcolumn

    0
0   1
1   2
2   1
3   2
4   2
.. ..
95  2
96  1
97  3
98  2
99  3

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [26]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

     0
0    1
1    2
2    1
3    2
4    2
..  ..
295  2
296  1
297  3
298  2
299  3

[300 rows x 1 columns]